###############################################################################
# Created by write_sdc
# Thu Jun 12 06:21:46 2025
###############################################################################
current_design cve2_register_file_ff
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_sys -period 12.5000 [get_ports {clk_i}]
set_clock_transition 0.2000 [get_clocks {clk_sys}]
set_clock_uncertainty 0.1000 clk_sys
set_propagated_clock [get_clocks {clk_sys}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {raddr_a_i[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {raddr_a_i[0]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {raddr_a_i[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {raddr_a_i[1]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {raddr_a_i[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {raddr_a_i[2]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {raddr_a_i[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {raddr_a_i[3]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {raddr_a_i[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {raddr_a_i[4]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {raddr_b_i[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {raddr_b_i[0]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {raddr_b_i[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {raddr_b_i[1]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {raddr_b_i[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {raddr_b_i[2]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {raddr_b_i[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {raddr_b_i[3]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {raddr_b_i[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {raddr_b_i[4]}]
set_input_delay 1.2500 -rise -max -add_delay [get_ports {rst_ni}]
set_input_delay 1.2500 -fall -max -add_delay [get_ports {rst_ni}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {test_en_i}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {test_en_i}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {waddr_a_i[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {waddr_a_i[0]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {waddr_a_i[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {waddr_a_i[1]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {waddr_a_i[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {waddr_a_i[2]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {waddr_a_i[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {waddr_a_i[3]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {waddr_a_i[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {waddr_a_i[4]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[0]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[10]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[11]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[12]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[13]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[14]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[15]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[16]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[17]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[18]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[19]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[1]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[20]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[21]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[22]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[23]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[24]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[25]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[26]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[27]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[28]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[29]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[2]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[30]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[31]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[3]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[4]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[5]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[6]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[7]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[8]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {wdata_a_i[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {wdata_a_i[9]}]
set_input_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {we_a_i}]
set_input_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {we_a_i}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[0]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[10]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[11]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[12]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[13]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[14]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[15]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[16]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[17]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[18]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[19]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[1]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[20]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[21]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[22]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[23]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[24]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[25]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[26]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[27]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[28]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[29]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[2]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[30]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[31]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[3]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[4]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[5]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[6]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[7]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[8]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_a_o[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_a_o[9]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[0]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[10]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[11]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[12]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[13]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[14]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[15]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[16]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[17]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[18]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[19]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[1]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[20]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[21]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[22]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[23]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[24]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[25]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[26]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[27]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[28]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[29]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[2]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[30]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[31]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[3]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[4]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[5]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[6]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[7]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[8]}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rdata_b_o[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rdata_b_o[9]}]
set_max_delay\
    -from [get_ports {rst_ni}] 12.5000
set_false_path -hold\
    -from [get_ports {rst_ni}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.5000 [get_ports {rdata_a_o[31]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[30]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[29]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[28]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[27]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[26]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[25]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[24]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[23]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[22]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[21]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[20]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[19]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[18]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[17]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[16]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[15]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[14]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[13]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[12]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[11]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[10]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[9]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[8]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[7]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[6]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[5]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[4]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[3]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[2]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[1]}]
set_load -pin_load 0.5000 [get_ports {rdata_a_o[0]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[31]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[30]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[29]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[28]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[27]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[26]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[25]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[24]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[23]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[22]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[21]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[20]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[19]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[18]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[17]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[16]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[15]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[14]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[13]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[12]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[11]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[10]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[9]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[8]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[7]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[6]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[5]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[4]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[3]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[2]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[1]}]
set_load -pin_load 0.5000 [get_ports {rdata_b_o[0]}]
###############################################################################
# Design Rules
###############################################################################
